[
  {
    "id": "traductora",
    "name": "Traductora",
    "desc": "A full-stack speech-to-speech translator application.",
    "appURL": "",
    "repoURL": "https://github.com/r0b-adams/traductora/",
    "imgsrc": "/images/traductora-demo.gif",
    "features": [
      "Speak in one language and hear its translation in another!",
      "Utilizes JSON Web Tokens (JWTs) for authentication and authorization.",
      "Custom React hooks interface with the browser Web Speech API Speech-to-Text (SpeechRecognition) and Text-to-Speech (SpeechSynthesis) interfaces."
    ],
    "tech": ["react", "node", "express", "mongodb", "redux", "mui"],
    "discussion": [
      "After reading about the Web Speech API supported by most modern browsers, I knew I wanted to check out its text-to-speech and speech-to-text capabilities. Having some muiltilingual family members living abroad, I decided to create a translator application to help me for when I visit.",
      "I had a lot of fun learning some new technologies: custom hooks interface with the Web Speech API, MUI provides easy-to-use components to speed up development, and the redux pattern is utilized not only for overall application state, but also in the decoupled state of each custom hook via React's useReducer method.",
      "Despite their support, there has been difficulty achieving functionality on mobile browsers and more research and troubleshooting are required for text-to-speech and speech-to-text features to work on Android/iOS. This app is a good candidate to implement in React Native in the near future."
    ]
  },
  {
    "id": "dad-jokes",
    "name": "Bearded Dad Jokes",
    "desc": "Combine the gravitas of facial hair with the dry hilarity of fatherly humor.",
    "appURL": "https://r0b-adams.github.io/dad-jokes/",
    "repoURL": "https://github.com/r0b-adams/dad-jokes/",
    "imgsrc": "/images/dad-jokes-demo.gif",
    "features": [
      "Mix and match rugged whiskers with wholesome punchlines!",
      "Grab an individual joke, beard, or both!"
    ],
    "tech": ["react", "node", "mui"],
    "discussion": [
      "Inspired by a friend's propensity for amusing puns, this humorous web app is a quick exploration into conditional rendering based on application state. Skeleton loaders are displayed while awaiting responses from the servers.",
      "Dadicated to Justin"
    ]
  },
  {
    "id": "console-log",
    "name": "Console Log",
    "desc": "A hub for players to store walkthroughs for their favorite video games!",
    "appURL": "",
    "repoURL": "https://github.com/r0b-adams/console-log/",
    "imgsrc": "/images/console-log-demo.gif",
    "features": [
      "Create a user profile and start saving text or links to your favorite walkthroughs.",
      "View, rate, and favorite walkthroughs posted by other users!",
      "Search for games using voice commands!",
      "Won “Best Presentation” of all final project submissions for University of Washington's spring full-stack web development certificate program."
    ],
    "tech": ["react", "node", "express", "mongodb", "sequelize", "tailwind"],
    "discussion": [
      "While many blogs and wikis dedicated to video games guides exist, we wanted one with most of the features but without all of the bloat that seems to accompany these sites. So we made one using a MERN (MongoDB, Express.js, React.js, Node.js) stack!",
      "I created the backend server and database, implemented JSON web token (JWT) authorization and authentication, and added voice search functionality. I also managed our GitHub repository, led code reviews, and approved pull requests."
    ]
  },
  {
    "id": "vedomy",
    "name": "Vedomý",
    "desc": "Space for self-reflection to record thoughts and daily health habits.",
    "appURL": "https://r0b-adams.github.io/vedomy/",
    "repoURL": "https://github.com/r0b-adams/vedomy/",
    "imgsrc": "/images/vedomy-demo.gif",
    "features": [
      "Reflect on your exercise, diet, and mood. Record your thoughts.",
      "Use the box-breathing module to return your breathing to its normal rhythm.",
      "Check out daily yoga, sleep, and recepie suggestions.",
      "Won \"People's Choice\" award for University of Washington's spring full-stack web development certificate program"
    ],
    "tech": ["javascript", "html", "css", "jquery", "materialize"],
    "role": [
      "Interfaced with 3rd-Party APIs to fetch data, created and populated recipe card",
      "Led code reviews and approved pull requests"
    ],
    "discussion": [
      "In response to the disruption of our daily dynamic caused by the pandemic, we wanted a space for contemplation and self-reflection of our habits.",
      "One challenge we had early on was being throttled on the number of availble calls by third-party APIs. To get around this problem, I wrote a function that would fetch unique data once per day and cache it to local storage. This solution meshed well with the application's envisaged daily use."
    ]
  },
  {
    "id": "pantrimonium",
    "name": "Pantrimonium",
    "desc": "Manage food inventory, monitor expiration dates, and create a shopping list.",
    "appURL": "",
    "repoURL": "https://github.com/r0b-adams/pantrimonium/",
    "imgsrc": "/images/pantrimonium-demo.gif",
    "features": [
      "Create a user profile to get started!",
      "Add, edit, and remove tiems from your fridge, freezer, or pantry!",
      "Generate a shopping list from items low in quantity.",
      "Be notified of expired and soon-to-expire items."
    ],
    "tech": ["node", "express", "mysql", "bootstrap", "handlebars"],
    "role": [
      "Fulfilled project manager and GitHub repository master roles",
      "Implemented client-side CRUD functionality",
      "Built server framework and added e-mail component with Nodemailer"
    ],
    "discussion": [
      "Motivated by kitchen and grocery shopping disorganization, this application aims to provide an interface for your kitchen inventory.",
      "I designed and implemented the server and database. On the client-side, I wrote functions to communicate create, read, update, and delete (CRUD) functions to the back-end.",
      "As project manager, I led daily stand-ups and code reviews, reviewed pull requests, and managed the Github repository"
    ]
  }
]
